#+TITLE: The spheres project
#+STARTUP: indent showall
** The table
#+BEGIN_SRC sql-mode 
CREATE TABLE bodies
(name VARCHAR(30) PRIMARY KEY,
 volume VARCHAR(30),
 apoapsis VARCHAR(30),
 periapsis VARCHAR(30),
 mass VARCHAR(30),
 surface_area VARCHAR(30)
 satelites INT,
 circumference VARCHAR(30),
 form VARCHAR(30),
 orbital_period VARCHAR(30),
 parent VARCHAR(30);

#+END_SRC

#+begin_src sql :engine postgresql :dbhost localhost :dbuser admin :dbpassword admin :database spheres_db
select * from bodies

#+END_SRC

#+RESULTS:
| name | volume | apoapsis | perihelion | mass | surface_area | satelites | circumference | form | orbital_period | parent |
|------+--------+----------+------------+------+--------------+-----------+---------------+------+----------------+--------|


** HugSQL add to db

create add-body! function
that makes a row out of a record.

#+BEGIN_SRC sql

-- :name add-body! :! :1
-- :doc adds a new body
INSERT INTO bodies
(name, volume, apoapsis, periapsis, mass, surface_area, satelites, circumference, form, orbital_period, parent)
VALUES (:name, :volume, :apoapsis, :periapsis, :mass, :surface_area, :satelites, :circumference, :form, :orbital_period, :parent);

#+END_SRC

#+BEGIN_SRC clojure
(add-body! earth)
(add-body! venus)
#+END_SRC

#+begin_src sql :engine postgresql :dbhost localhost :dbuser admin :dbpassword admin :database spheres_db
select * from bodies;
#+END_SRC

#+RESULTS:
| name  |     volume |    apoapsis |  periapsis |       mass | surface_area | satelites | circumference | form   | orbital_period | parent |
|-------+------------+-------------+-------------+------------+--------------+-----------+---------------+--------+----------------+--------|
| Earth | 1.08321e12 |   152098232 |   147098290 | 5.97219e24 |    510072000 |         1 |     40075.017 | planet |  365.256363004 | Sun    |
| Venus |  9.2843e11 | 108,939,000 | 107,477,000 |  4.8675e24 |     4.6023e8 |         0 |         38025 | planet |        224.701 | Sun    |

Both functions add-body and insert-body-record return an exception
when trying to insert a record that already exists

** First Thing's First. extracting data from db 

Need to convert the data from the db to a record again This is
just an exercise, there is no real point in connverting back and
forth, the db idea is in order to be able to expand.

so a row from the database looks like this:
#+BEGIN_SRC clojure :results value 
(first (get-bodies))
#+END_SRC

#+RESULTS:
| :mass | 5.97219e24 | :parent | Sun | :orbital_period | 365.256363004 | :name | Earth | :satelites | 1 | :circumference | 40075.017 | :volume | 1.08321e12 | :periapsis | 147098290 | :surface_area | 510072000 | :form | planet | :apoapsis | 152098232 |

first thing, extract a row by the value of the name:

#+BEGIN_SRC clojure
;;a wrapper for the wrapper:
(defn get-row [body]
  (spheres.db.core/get-body {:name (clojure.string/capitalize body)}))

#+END_SRC


Now to extract whatever field:
#+BEGIN_SRC clojure
(defn get-data [body attr]
  "expects two strings first for body second for the attribute"
  (let [b (clojure.string/capitalize body)
        a (-> attr keyword)]
    (let [result (a (get-body {:name b}))]
      (if (int? result)
        result
        (if (double? (try (Double/parseDouble result)
                          (catch java.lang.NumberFormatException
                              result)))
             (Double/parseDouble result)
             result)))))

#+END_SRC

